In [26]:
import pandas as pd

In [27]:
dataset1=pd.read_excel(r'G:\personal\ML Exercise\tidy_data.xlsx')
dataset1.drop(columns='Unnamed: 0',inplace=True)

In [28]:
dataset1_pivot=dataset1.pivot(index='Country',columns='PopulationType',values='Person')
dataset1_pivot

PopulationType   Female      MALE
Country
BAN              838383  73839393
IND             8394949  85125465
PAK             3894484  74748484

In [29]:
dataset2=pd.read_excel(r'G:\personal\ML Exercise\tidy2_data.xlsx')
dataset2.drop(columns='Unnamed: 0',inplace=True)

In [30]:
dataset2_pivot=dataset2.pivot_table(index=(['Month','Day']), columns='Observation', values='Reading')

In [31]:
dataset2_pivot

Observation  Ozone  Solar  Temp
Month Day
5     1       41.0  190.0  67.0
      2       36.0  118.0  72.0
      3       12.0  149.0  74.0
      4       18.0  313.0  62.0
      5        NaN    NaN  56.0

In [32]:
dataset1.append({
    'Country':'BAN',
    'PopulationType' :'MALE',
    'Person':2928272,
    
},ignore_index=True)

  Country PopulationType    Person
0     IND           MALE  85125465
1     PAK           MALE  74748484
2     BAN           MALE  73839393
3     IND         Female   8394949
4     PAK         Female   3894484
5     BAN         Female    838383
6     BAN           MALE   2928272

In [33]:
import numpy as np
dataset1_pivot_aggf=dataset1.pivot_table(
    index='Country',
    columns='PopulationType',
    aggfunc='mean')

In [34]:
dataset1_pivot_aggf

                 Person
PopulationType   Female      MALE
Country
BAN              838383  73839393
IND             8394949  85125465
PAK             3894484  74748484